Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་མེད་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ལོངས་ཤིག་བཙུན་པ་ཀུན་དགའ་བོ། །
en: The bodhisattva great being Without Reference then spoke in verse to Venerable Ānanda: “Get up, honorable Ānanda!

source: ཆོས་འགའ་འོང་བ་ཡོད་མིན་ལ། །འགྲོ་བར་འགྱུར་བའང་མེད་པས་ན། །མྱ་ངན་མ་བྱེད་ཆོས་ཉིད་ལྟོས། །
en: Since there is nothing that comes, There is also nothing that goes, So do not be upset; consider the true nature!

source: སངས་རྒྱས་སྐྱེ་བ་ཅི་འདྲ་བར། །དེ་ཡི་བྱང་ཆུབ་དེ་དང་འདྲ། །འཁོར་ལོ་བསྐོར་བ་ཅི་འདྲ་བར། །མྱ་ངན་འདའ་བའང་དེ་དང་འདྲ། །
en: “The way a buddha is born Is like his awakening; The way he turns the wheel Is like his passing into nirvāṇa.

source: སངས་རྒྱས་ནམ་ཡང་སྐྱེ་མེད་ཅིང་། །སངས་རྒྱས་འགག་པར་འགྱུར་བའང་མེད། །
en: “A buddha is never born, Nor does a buddha ever cease.

source: རང་བཞིན་དེ་འདྲའི་ཆོས་རྣམས་ལ། །ཀུན་དགའ་ཁྱོད་ནི་ཅི་ཕྱིར་ངུ་། །
en: This is the nature of all phenomena, So why are you crying, Ānanda?

source: ཁོ་བོའི་སྤུ་ཡི་ཁུང་བུ་ནས། །སྟོང་དང་དངོས་པོ་མེད་པ་དང་། །ཉེ་བར་ཞི་དང་སངས་རྒྱས་ཞེས། །སྒྲ་སྐད་བཞི་པོ་འབྱུང་བ་ཉོན། །
en: “Listen to these four words That issue from my pores: ‘Emptiness,’ ‘unreal,’ ‘Peace,’ ‘awakened.’ ”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རིགས་ཀྱི་བུ་དམིགས་མེད་ལ་ཕྱིར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། བརྟུལ་ཞུགས་བཟང་པོ་ཁྱེད་ཅག་ལྟ། །མྱུར་དུ་ཞིང་གཞན་འགྲོ་འགྱུར་ཞིང་། །
en: Venerable Ānanda replied to the noble son Without Reference in verse: “Well-disciplined ones such as yourself Will soon be going to other realms.

source: དེར་ཡང་བདུད་རྩིའི་ཚིག་གསུང་བ། །རྫོགས་པའི་སངས་རྒྱས་མཐོང་བར་འགྱུར། །
en: There, too, you will see a perfect buddha Who teaches with nectar-like words.

source: དེར་ནི་ཟབ་མོ་སངས་རྒྱས་ཀྱིས། །གསུང་བའི་ཆོས་ཀྱང་ཐོས་འགྱུར་ལ། །སངས་རྒྱས་རྣམས་ཀྱི་ཚོགས་ཀྱི་མཆོག །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་མཐོང་། །
en: “There you will hear the profound Dharma Taught by an awakened one, And there you will also see bodhisattvas, The supreme saṅgha of the buddhas.

source: ཁོ་བོ་འཇིག་རྟེན་མགོན་འདས་ཞེས། །ལྷ་རྣམས་བྱེ་བ་མང་པོ་དག །ཆོ་ངེས་འདེབས་པས་མདུན་བདར་ན། །མཁས་པ་ཇི་ལྟར་གནས་པར་བྱ། །
en: “But, learned one, How can I stay here, Escorted by many millions of lamenting gods, and say ‘The world protector has passed away’?

source: དགེ་བསྙེན་སྟོང་ཕྲག་མང་པོ་རྣམས། །ཐམས་ཅད་ཤུགས་ཆེན་དུ་བྱེད་ཅིང་། །
en: “Many thousands of lay devotees Are weeping desperately.

source: བདག་གི་དྲུང་དུ་ལྷགས་གྱུར་ན། །ཁོ་བོས་ཇི་ལྟར་ལན་ཡང་གདབ། །
en: When they come to me, How shall I answer them?

source: སུམ་ཅུ་རྩ་གསུམ་འཐབ་བྲལ་དང་། །དགའ་ལྡན་པ་དང་རབ་འཕྲུལ་དང་། །དབང་སྒྱུར་ཚངས་པ་ལ་སོགས་པའི། །ལྷ་ཚོགས་ཉེ་བར་ལྷགས་པ་རྣམས། །
en: “Hosts of gods have come here— From the Heaven of the Thirty-Three, the Heaven without Conflict, The Heaven of Joy, The Heaven of Good Emanation, The Heaven of Mastery over Others’ Emanations, the Brahmā realms and so on.

source: ཤཱཀྱ་སྐྱེས་མཆོག་འདས་གྱུར་ན། །ཇི་ལྟར་ཡོངས་སུ་གཟེངས་བསྟོད་ཅིང་། །བདག་ནི་ཇི་ལྟར་དེ་དག་ལ། །དམ་ཆོས་སྨྲ་བ་སྤོབས་པར་འགྱུར། །
en: “If the greatest of the Śākyas passes, How will I raise myself up And, in front of them, Dare to preach the sublime Dharma?

source: སྐྱེས་བུ་སྐྱེས་མཆོག་འདས་གྱུར་ན། །ཀུན་དགའ་འདྲེན་པ་གང་ན་ཞེས། །ལྷ་རྣམས་འདྲི་བར་གྱུར་པའི་ཚེ། །
en: “If the noble one, the supreme one, passes, When the gods ask me, ‘Ānanda, where is the guide?’

source: རྣམ་འདྲེན་བསམ་གཏན་ཟབ་མོ་དང་། །བསོད་ནམས་ཆེན་པོའི་གནས་པ་ལ། །ནང་དུ་ཡང་དག་བཞག་གོ་ཞེའམ། །
en: How should I reply? “ ‘The guide is in profound concentration,’ ‘He abides in a state of great merit,’ ‘He is immersed in meditation’?

source: འོན་ཏེ་འཆག་ཅིང་བཞུགས་སོ་ཞེས། །
en: Or should I say he is out walking, or that he is here?”

source: ཇི་ལྟར་ཚིག་གི་ལན་ཡང་གདབ། །དེ་ནས་རིགས་ཀྱི་བུ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཐོབ་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཟླ་བ་གསུམ་པོ་འདི་འདས་ནས། །ཁོ་བོས་ཕྱིས་ཀྱང་བལྟ་བྱ་བར། །
en: The noble son Flower of Clairvoyance then spoke to Venerable Ānanda in verse: “Three months from now, You will see me again.

source: བདག་ནི་ཁྱོད་ལ་དམ་འཆའ་ཡིས། །ཀུན་དགའ་ཐོང་ཤིག་མ་ངུ་ཤིག །
en: I make this promise to you, So let it go, Ānanda, and do not cry!

source: སངས་རྒྱས་སྟོང་ཕྲག་གཞན་དག་ལ། །ཤཱཀྱའི་ཏོག་གི་ཆ་བྱད་ཀྱིས། །ཆོས་མཆོག་བཤད་པར་མཛད་གསོལ་ཞེས། །ཁྱོད་ཕྱིར་བདག་གིས་གསོལ་བར་བྱ། །
en: “On your behalf, I will request Thousands of other buddhas To expound the supreme Dharma Taught by the crown ornament of the Śākyas.

source: རྫོགས་སངས་ཐུགས་རྗེས་གཟིགས་མཛད་ཅིང་། །ཁྱོད་ཀྱི་མདུན་དུ་གཤེགས་པར་འགྱུར། །
en: “The perfect buddhas will watch over you with compassion; They shall come before you.

source: ཁྱོད་ཀྱིས་མི་མཆོག་ཡོངས་བསྙེན་གྱིས། །ཀུན་དགའ་འདི་ལ་ཁྱོད་མ་ངུ་། །
en: And you will serve those supreme humans well, So do not cry at this, Ānanda!

source: གང་དུ་འདི་འདྲའི་སྟོན་པ་ནི། །འཇིག་རྟེན་དུ་ནི་འདའ་འགྱུར་བ། །ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས། །མྱ་ངན་ཆེན་པོ་བྱ་བའི་རིགས། །
en: “Whenever a teacher such as this Passes from the world, It is reasonable for the world with its gods To mourn him greatly.

source: བདག་གིས་སངས་རྒྱས་འདི་སྐད་ཅེས། །བསྐལ་པ་བྱེ་བར་འཚོ་གྱུར་པའི། །འདུས་བྱས་ཐམས་ཅད་མཐར་འཇིག་ཅེས། །གསུངས་པ་སྟོན་པའི་དྲུང་ནས་ཐོས། །
en: “Yet as I have heard the Buddha say, All composite things, sustained over millions of eons, Are eventually destroyed; I heard this directly from the teacher.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཀྱིས་སྣམ་ལོགས་སུ་འདུག་ནས་ལན་གསུམ་དུ་སྙིང་རྗེ་ཆེན་པོའི་སྒྲ་བསྒྲགས་པ།
en: Venerable Ānanda then sat behind the Thus-Gone One and let out a piteous cry three times.

source: མདོངས་པར་གྱུར་པའི་སེམས་ཅན་ལ། །གང་གིས་མིག་ནི་སྩོལ་མཛད་ཅིང་། །
en: “Who will grant sight To those who are blind?

source: སྲོག་ཆགས་ཀུན་མགོན་གང་ཡིན་པ། །སྟོན་པ་དེ་རིང་མྱ་ངན་འདའ། །
en: The protector of all beings, Our teacher, will pass into nirvāṇa today!”

source: མི་རྣམས་འདྲེན་པ་དེ་འདས་ཞེས། །ཚིག་འདི་ཐོས་པར་གྱུར་ན་ནི། །རྒྱལ་པོ་དམ་པ་ལུས་འཕགས་བུ། །ཤིན་ཏུ་སྡུག་བསྔལ་ཇི་ལྟར་གནས། །དེ་ནས་གྱད་དང་གྱད་མོ་དང་། །
en: “When he hears That the guide has passed away, The great king, son of Vaidehī, Will be deeply distraught.

source: གྱད་ཀྱི་བུ་རྣམས་མི་བཟད་ཅིང་། །མི་མཆོག་མྱ་ངན་འདའ་འགྱུར་ཞེས། །དེ་ན་སྙིང་རྗེས་ངུ་བར་བྱེད། །
en: “The Malla men and women, The Malla children, too, will be unable to bear it; On hearing ‘the best of men is passing,’ All shall weep pitifully.

source: ཐ་མའི་སྟོན་པ་བལྟ་བའི་ཕྱིར། །དེ་དག་དེར་ནི་ལྷགས་གྱུར་ནས། །
en: “To see their teacher for the last time, They have hastened here.

source: ཐལ་སྦྱར་རབ་བཏུད་འཁོད་ནས་ནི། །འདུད་ཅིང་ཕྱག་ཀྱང་འཚལ་བར་བྱེད། །
en: Bowing low with folded hands, They pay homage with their bows.

source: དཔག་ཚད་ལྔ་ཡི་ཁོར་ཡུག་ཏུ། །ལྷ་དང་གནོད་སྦྱིན་རྣམས་ཀྱིས་གང་། །དེ་ཡི་ཁོ་ར་ཁོར་ཡུག་ཏུ། །མི་རྣམས་ཀྱིས་ནི་གནས་མི་རྙེད། །
en: “For five leagues all around, The area is filled with gods and yakṣas, So humans can find no space Anywhere, all around.

source: དྲང་སྲོང་དམ་པ་མཆོད་པའི་ཕྱིར། །དྲི་ཞིམ་མེ་ཏོག་ཆུ་བོ་དག །པུས་མོ་ནུབ་ཙམ་ཕབ་གྱུར་ཅིང་། །ཕྱེ་མའི་ཆར་པའང་ཕབ་པར་གྱུར། །
en: “As an offering to the sublime sage, A rain of fragrant flowers falls, Piling high, hiding their knees, And there falls a rain of powders too.

source: དེ་ནས་དགའ་བོ་ཉེ་དགའ་གཉིས། །ཐ་མའི་སྟོན་པ་བལྟ་བའི་ཕྱིར། །བྱེ་བ་དྲུག་ཅུའི་ཀླུ་རྣམས་དང་། །ཡོངས་སུ་མྱ་ངན་འདས་པར་ལྷགས། །བྲང་འགྲོ་ཆེན་པོ་ཆུ་ལྷ་དང་། །གཟི་ཅན་དང་ནི་རྒྱ་མཚོ་དང་། །གསལ་མཐོང་དང་ནི་བཏང་བཟུང་དག །
en: “Then Nanda and Upananda, With six hundred million nāgas, Came to see the teacher for the last time, To witness his parinirvāṇa.

source: བྱེ་བ་ཕྲག་བརྒྱའི་ཀླུས་བདར་ཅིང་། །ཐ་མའི་སྟོན་པ་བལྟ་བའི་ཕྱིར། །སྤོས་ཆུའི་སྤྲིན་དག་འདུས་བྱས་ཤིང་། །ནམ་མཁའི་ངོས་ནི་ཁེབས་བྱས་ཏེ། །ཆར་བཞིན་འབེབས་ཤིང་ཉེ་བར་ལྷགས། །
en: “The great nāgas Varuṇa, Manasvin, Sāgara, Huluka, and Mucilinda, Escorted by billions of nāgas— “As they came to see the teacher for the last time, Gathering clouds of fragrant mist That veiled the sky Descended like rain.

source: འཇིག་རྟེན་མགོན་པོ་མཆོད་པའི་ཕྱིར། །ལྷ་ཀླུས་ལྷ་ཡི་མེ་ཏོག་གི། །ཆར་དང་སྤོས་ཆུ་གཙང་མ་ཡི། །ཆར་པ་དག་ཀྱང་རབ་ཏུ་ཕབ། །
en: “As an offering to the protector of the world, Both gods and nāgas Have showered rains of divine flowers And pure, fragrant water.

source: ཀླུ་ཡི་རྒྱལ་པོ་མ་དྲོས་པ། །དུང་ཕྱུར་དྲུག་དང་ལྷན་ཅིག་ཏུ། །རིན་ཆེན་ཆར་པ་རབ་འབེབས་ཤིང་། །སྐྱེས་བུ་ཁྱུ་མཆོག་དྲུང་དུ་ལྷགས། །
en: “The nāga king Anavatapta, With six hundred million, Released a rain of jewels As he arrived before the leader of men.

source: བྲང་འགྲོ་ཆེན་པོ་ཨེ་ལའི་འདབ། །ལྷུན་པོ་ཙམ་ཡང་ངུ་བྱེད་ཅིང་། །ཐ་མའི་འཇིག་རྟེན་མགོན་པོ་ལ། །མཆོད་པ་བྱ་ཕྱིར་ཉེ་བར་འོངས། །
en: “The great nāga Elāpatra, Crying a great mountain of tears, Has come to make offerings, For the last time, to the protector of the world.

source: ཀླུ་ཡི་བུ་མོ་སྟོང་དང་ནི། །བརྒྱ་དང་ཁྲག་ཁྲིག་རྣམས་དག་ཀྱང་། །ང་རོ་སྤྲིན་སྙེད་སྒྲོགས་བྱེད་ཅིང་། །སྟོན་པའི་དྲུང་དུ་ཉེ་བར་ལྷགས། །ཐ་མའི་འཇིག་རྟེན་མགོན་པོ་ལ། །མཆོད་པ་བྱ་ཕྱིར་དེ་དག་གིས། །སྤོས་ཆུ་གཙང་མའི་ཆར་ཆེན་ཡང་། །
en: “Throngs of female nāgas, Hundreds of billions of them, Filling clouds with their voices, Have arrived before the teacher, “Releasing a great rain Of pure, scented water As a final offering To the protector of the world.

source: དེར་ནི་མངོན་པར་རབ་ཏུ་ཕབ། །གནོད་སྦྱིན་སྟོང་ཕྲག་བྱེ་བ་དང་། །བརྒྱ་དང་ཁྲག་ཁྲིག་རྣམས་དག་ཀྱང་། །སངས་རྒྱས་ཡོན་ཏན་དྲན་བྱེད་ཅིང་། །བལྟ་བའི་ཕྱིར་ནི་ཉེ་བར་ལྷགས། །
en: “Hosts of yakṣas, Thousands of billions of them, Recalling the Buddha’s qualities, Have also come to watch.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་ཀྱང་། །ཐ་མའི་སངས་རྒྱས་བལྟ་བའི་ཕྱིར། །ངུ་བཞིན་མཆི་མས་བརྣངས་གྱུར་ཅིང་། །སྟོན་པའི་དྲུང་དུ་ཉེ་བར་ལྷགས། །དེ་བཞིན་ལྷ་དབང་བརྒྱ་བྱིན་ཡང་། །སུམ་ཅུ་གསུམ་པ་སྟོང་ཕྲག་ནི། །
en: “The Four Great Kings, too, Crying and choked with tears, Have arrived before the Buddha To see their teacher one last time.

source: སུམ་ཅུ་གསུམ་གྱིས་མདུན་བདར་ཅིང་། །རྫོགས་སངས་རྒྱས་ཀྱི་དྲུང་དུ་འོངས། །དྲང་སྲོང་དམ་པ་མཆོད་པའི་ཕྱིར། །དེས་ཀྱང་མེ་ཏོག་མན་དར་དང་། །ལྷ་ཡི་ཙན་དན་ཕྱེ་མ་ཡི། །ཆར་པ་མངོན་པར་རབ་ཏུ་ཕབ། །
en: “Śakra, too, lord of gods, Escorted by thirty-three thousand From the Heaven of the Thirty-Three, Has arrived before the perfect Buddha, “Showering rains Of mandāra flowers And powders of divine sandalwood As an offering to the sublime sage.

source: ཚངས་པ་ངན་སྤོང་གཙུག་ཏོར་ཅན། །ཐ་མའི་སྟོན་པ་བལྟ་བའི་ཕྱིར། །གཉིས་ཀ་ཚངས་པས་མདུན་བདར་ཅིང་། །ངུ་མོས་འདེབས་ཤིང་རྗེས་སུ་ལྷགས། །
en: “The brahmās Bhṛgu and Śikhin, Both escorted by brahmās, Have also come, sobbing, To see their teacher one last time.

source: གནས་གཙང་ལྷ་བརྒྱ་བྱེ་བ་ཕྲག །མང་པོ་གཟི་བརྗིད་ཆེན་པོ་རྣམས། །དེ་རིང་རྒྱལ་བ་འདའ་འགྱུར་ཞེས། །ངུ་མོས་འདེབས་ཤིང་ལྷགས་པར་གྱུར། །
en: “Many billions of majestic gods From the pure abodes, Saying, ‘The Victor will pass away today,’ And sobbing, have also come.

source: ལྷ་བརྒྱ་བྱེ་བ་ཕྲག་མང་པོ། །རྣམ་མང་ཆོ་ངེས་འདེབས་བྱེད་ཅིང་། །མི་མཆོག་བསྐལ་པར་བཞུགས་གསོལ་ཞེས། །བསམ་གཏན་ཆེ་ལ་གསོལ་བ་འདེབས། །
en: “Many billions of gods, Lamenting in all manner of ways, Have beseeched him in his great concentration: ‘Best of men, please stay for an eon!’

source: བདུད་ཀྱི་བུ་ཕོ་མཁས་པ་པོ། །དེད་དཔོན་ཞེས་ནི་བྱ་བ་ཡང་། །མི་མཆོག་མྱ་ངན་འདའ་འགྱུར་ཞེས། །ཤིན་ཏུ་སྡུག་བསྔལ་གྱུར་ཅིང་འོངས། །
en: “A wise son of Māra Known as Sārthavāha Has also come in great agitation, Saying ‘the best of men will pass into nirvāṇa.’

source: དེས་ཀྱང་ཞབས་ལ་གཏུགས་ནས་ནི། །ཤཱཀྱའི་རིགས་སྣང་འཇིག་རྟེན་ལ། །བརྩེ་སླད་བསྐལ་པར་བཞུགས་སུ་གསོལ། །
en: “He, too, has bowed to his feet, Begging him with these words: ‘Light of the Śākyas, for love of the world, Please stay for an eon!’

source: རྫོགས་པའི་སངས་རྒྱས་བཞུགས་གྱུར་ན། །ལྷ་དང་མི་ཡི་བདག་པོ་ལ། །བསམ་ཡས་དོན་དུ་འགྱུར་ལགས་ཀྱིས། །
en: “If the perfect Buddha stays, It will be of inconceivable benefit To the lords of both gods and humans.

source: ཐུབ་ཆེན་བསྐལ་པར་བཞུགས་གསོལ་ཞེས། །མི་ཡི་མཆོག་ལ་གསོལ་བ་འདེབས། །
en: Great sage, please stay for an eon!”

source: དེ་ནས་རིགས་ཀྱི་བུ་དམིགས་མེད་ཀྱིས་ལྷ་དང་བཅས། ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་དེ་དང་། བདུད་ཀྱི་བུ་དེད་དཔོན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། བག་མེད་པས་ནི་འདས་བྱས་ཤིང་། །དེ་ལྟར་སྨྲེ་སྔགས་འདོན་བྱེད་པ། །
en: Then, the noble son Without Reference spoke in verse to this world, with its gods and Brahmās, and to Sārthavāha, son of Māra: “Have you all lost your minds, To cry and wail like this— You are all ignorant fools; This is how monkeys behave!

source: ཁྱེད་ཀུན་མི་ཤེས་བྱིས་པ་སྟེ། །སྤྲེའུ་རྣམས་དང་ནི་འདྲ་བ་ཡིན། །ཇི་ལྟར་ཕག་ནི་སེམས་བྲལ་ཞིང་། །ཉལ་བ་མཚོན་ཆ་རྣམ་དག་གིས། །ཡོངས་སུ་གཤེགས་ནས་སད་པ་ན། །སྙིང་རྗེས་སྨྲེ་སྔགས་འདོན་པ་ལྟར། །
en: “You whine piteously Like mindless pigs Woken from sleep By the slashing of blades.

source: བག་མེད་དབང་སོང་སྔན་ཅད་ནི། །གང་གིས་ཆོས་རྣམས་མ་ཐོས་པ། །
en: “Those who in the past have been overcome by carelessness Have not been able to hear Dharma teachings.

source: ཁྱེད་ཅག་ཐམས་ཅད་དེ་འདྲ་བར། །
en: You are all like them!

source: ཁོ་བོས་དེ་ལྟར་སྤོབས་པ་ཡིན། །དེ་རིང་ཡེ་ཤེས་སྒྲོན་མ་ནི། །འཇིག་རྟེན་དུ་ནི་ནུབ་འགྱུར་ཞིང་། །ཀྱེ་མ་རྒྱལ་བ་འདས་འགྱུར་གྱིས། །དགེ་བ་དག་གིས་ལས་གྱིས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་།
en: This is what I have to say: “Today, the lamp of wisdom Will disappear from this world; Alas, the victor will pass, So do good deeds!”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་དོན་ཡོད་རྒྱལ་པོ་དང་། གནས་བརྟན་འོད་སྲུང་གཞོན་ནུ་དང་། གནས་བརྟན་གསུས་པོ་ཆེ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཀྱི་ལག་པ་གཡས་པ་དག་དེ་བཞིན་གཤེགས་པའི་ཕྱག་ཏུ་ཕུལ་ཅིག །
en: The Blessed One then said to Venerable Aniruddha, Venerable Pūrṇamaitrāyaṇīputra, Venerable Subhūti, Venerable Amogharāja, the elder Kāśyapakumāra, and the elder Mahākauṣṭhila, “Monks, place your right hands in the hand of the Thus-Gone One.”

source: དགེ་སློང་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལེགས་ལགས་སོ་ཞེས་གསོལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏོ། །
en: “Yes of course, Blessed One,” they replied, and they did as the Blessed One told them.

source: དེ་ནས་དགེ་སློང་འབུམ་ཐམ་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་ཏུ་རང་རང་གི་ལག་པ་ཕུལ་ལོ། །
en: A hundred thousand monks then each raised their hands to the Blessed One’s hand.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གཡོན་པས་ནི་དགེ་སློང་དེ་དག་ཐམས་ཅད་ཀྱི་ལག་པ་ནས་བཟུང་། ཕྱག་གཡས་པས་ནི་ཀུན་དགའ་བོ་དང་། སྒྲ་གཅན་ཟིན་གྱི་ལག་པ་ནས་བཟུང་སྟེ། དགེ་སློང་དག་གནས་བརྟན་རྣམས་ལ་ཀུན་དགའ་བོ་བཟང་པོ་དང་། དཔལ་སྒྲ་གཅན་ཟིན་འདི་གཉིས་བཅོལ་ཅིང་ཡོངས་སུ་གཏད་དོ་ཞེས་ཕྱག་གིས་དགེ་སློང་དེ་དག་གི་ལག་ཏུ་གཏད་དོ། །
en: Taking all those monks by the hand with his left hand, and with his right taking Ānanda and Rāhula by the hand, he said to the monks and elders, “Good Ānanda and glorious Rāhula are hereby entrusted and invested,” and with his hand he pressed the hands of those monks.

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སྒྲ་སྐད་དང་ང་རོའི་སྒྲ་སྙིང་རྗེ་ཞིང་འཇིགས་སུ་རུང་བ་དག་བྱུང་བར་གྱུར་ཅིང་སྒྲ་སྐད་དེས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གྲགས་པར་གྱུར་ཏོ། །
en: At that moment, piteous and terrifying roaring sounds resounded across the buddha field; cries filled the entire buddha field.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་གཉིས་གནས་བརྟན་དེ་དག་ལ་ཡོངས་སུ་གཏད་པ་མཐོང་ནས་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱིས་ཚེའི་འདུ་བྱེད་བཏང་བར་གྱུར་ཏོ། །
en: Then, having seen the two elders Venerable Ānanda and Venerable Rāhula entrusted, around five hundred monks took their own lives.

source: འདི་ལྟར་དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་བལྟ་བར་མི་བཟོད་པའི་ཕྱིར་ཏེ། དེ་དག་འདི་སྙམ་དུ་འཇིག་རྟེན་གྱི་མགོན་པོ། འཇིག་རྟེན་གྱི་སྒྲོན་མ། ཐུགས་རྗེ་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་དམ་པ། ཐུགས་བརྩེ་བ་དང་ལྡན་པ། ཕན་པར་བཞེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་བདག་ཅག་བལྟ་བར་མི་སྤྲོས།
en: Because those monks, unable to bear watching the Blessed One passing into parinirvāṇa, thought, “How can we watch as the protector of the world, the lamp of the world, our sublime and compassionate spiritual mentor who is filled with kindness, who brings such benefit, passes into parinirvāṇa?

source: ཇེ་དང་པོ་ཁོ་ནར་བདག་ཅག་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ། །སྙམ་དུ་སེམས་པའི་ཕྱིར་རོ། །
en: We will pass completely beyond suffering first!”

source: དེ་ནས་སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལྔ་བརྒྱ་ཐམ་པས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་བཞུགས་བཞིན་དུ་ཕྱག་གཡས་པ་རྣམས་བརྐྱང་སྟེ། བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་བཏུད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གིས་ཀུན་དགའ་བོ་དང་། སྒྲ་གཅན་ཟིན་དང་།
en: At that moment, right then, at that very instant, five hundred blessed buddhas, while remaining in their own pure buddha fields, extended their right arms and bowed low toward the Blessed One.

source: གནས་བརྟན་རྣམས་ཀྱི་ལག་པ་ནས་བཟུང་སྟེ་ཕྱག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཕྱག་ཏུ་ཕུལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །སྒྲ་གཅན་ཟིན་འདི་བདག་གི་བུ། །ཀུན་དགའ་བོ་ནི་གོ་རེ་ལོང་། །འདི་གཉིས་དྲང་སྲོང་ཆེ་རྣམས་ལ། །
en: The Blessed One, taking Ānanda, Rāhula, and the elders by the hand, raised his other hand in greeting to those thus-gone ones, and the Blessed One spoke these verses: “Rāhula is my own son, Ānanda is my attendant; I have fully invested These two great sages.

source: མངོན་སུམ་དུ་ནི་ཡོངས་སུ་གཏད། །དེ་རིང་འཛམ་བུའི་གླིང་དུ་ནི། །བདག་གི་མཚན་མོ་ཐ་མར་འགྱུར། །
en: “Tonight will be my last night Here in this world.

source: ལྷ་དང་ཀླུ་དང་མི་རྣམས་ཀྱིས། །སླན་ཅད་བདག་ནི་མཐོང་མི་འགྱུར། །
en: Neither gods, nāgas, nor humans Will henceforth see me again.

source: གང་དག་བྱམས་པ་བསམ་ཡས་པའི། །འཇིག་རྟེན་མགོན་རྣམས་མ་གཏོགས་པར། །གཞན་གང་བདག་ལ་སྐྱོབ་འགྱུར་ཞིང་། །སུ་ཞིག་དཔུང་གཉེན་སྐྱབས་སུ་འགྱུར། །སེམས་ཅན་གཅིག་གི་སླད་དུ་ཡང་། །
en: “Apart from those protectors of the world, Whose love is inconceivable, Who will protect all the others And be their refuge and last resort?

source: བསྐལ་པ་སྟོང་ཕྲག་མང་པོ་ནི། །གང་གཱའི་བྱེ་མ་ཇི་སྙེད་པ། །དེ་སྙེད་བསྐལ་པར་བསྡད་བགྱི་ན། །ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི། །འཇིག་རྟེན་ཁམས་སུ་རྣམ་བལྟས་ན། །གང་གི་ཕྱིར་ནི་འདིར་བསྡད་པའི། །སེམས་ཅན་འགའ་ཡང་མ་མཐོང་ངོ་། །
en: “If, for the sake of single being, I stay many thousands of eons, As many eons as there are Grains of sand in the river Gaṅgā, “If I watch out for world systems Inconceivably limitless in number, Why would I not have seen Any beings living here?

source: སེམས་ཅན་གང་དག་ཆོས་འདི་ལ། །གུས་བཅས་དོན་ནི་བདག་གིས་བགྱིས། །བློ་གྲོས་ངན་པ་གཞན་དག་ནི། །སངས་རྒྱས་བྱེ་བས་གདུལ་མི་སྤྱོད། །
en: “I have benefited those beings Who respect this Dharma; Those others, of weak intellect, Could not be tamed by ten million buddhas.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལྔ་བརྒྱ་ཐམ་པ་དེ་དག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །ཁྱོད་ཀྱིས་སེམས་ཅན་དོན་རྣམས་མཛད། །སངས་རྒྱས་མཛད་པའང་ཁྱོད་ཀྱིས་མཛད། །ཆོ་འཕྲུལ་དག་ཀྱང་བསྟན་མཛད་ཅིང་། །ཆོས་ཀྱི་རྔ་ཆེན་རབ་ཏུ་བརྡུངས། །
en: Then those five hundred blessed buddhas spoke in verse: “You have done so much to help beings: You have performed all the deeds of a buddha, You have displayed miracles, And you have sounded the great Dharma drum.

source: སྐྱོབ་པ་ཤཱཀྱ་སེང་གེ་ཡིས། །སྤྲིན་གྱིས་ས་གཞི་ཆེན་པོ་ལྟར། །སྲོག་ཆགས་བྱེ་བ་ཚིམ་མཛད་ཅིང་། །སེམས་ཅན་རྣམས་ཀྱི་ཟུག་རྔུ་ཕྱུང་། །
en: “Protector, lion of the Śākyas, Like a cloud passing over the vast earth You have nourished millions of beings And removed their pain.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་གྱིས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། སངས་རྒྱས་རྣམས་ཀྱི་གཟི་བརྗིད་ཀྱིས། །སྤྱན་ལྡན་བསྐལ་པར་མཐོང་བ་དང་། །
en: Then Venerable Ānanda and Venerable Rāhula, placing their right knees on the ground, supplicated those blessed buddhas in verse: “With your awakened splendor, May you seers watch over us for eons!

source: འདྲེན་པ་བསྐལ་པར་བཞུགས་འགྱུར་བར། །
en: May you guides remain with us for eons!

source: དཔའ་ཆེན་རྣམས་ལ་གསོལ་བ་འདེབས། །
en: We beseech you, great heroes!

source: རྫོགས་པའི་སངས་རྒྱས་རྐང་གཉིས་མཆོག །ཤེས་རབ་ཆེན་པོ་བཞུགས་གྱུར་ན། །སྲོག་ཆགས་བྱེ་བ་མང་པོ་ལ། །བསམ་གྱིས་མི་ཁྱབ་དོན་དུ་འགྱུར། །
en: “If perfect buddhas, the best of humans, Remain with great insight, Inconceivable good will accrue For many millions of beings.

source: ལྷ་ཡི་ཚོགས་རྣམས་འཕེལ་འགྱུར་ཞིང་། །ལྷ་མིན་རྣམས་ཀྱང་འགྲིབ་པར་འགྱུར། །ཉན་ཐོས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་། །བསམ་གྱིས་མི་ཁྱབ་འཕེལ་བར་འགྱུར། །
en: “The hosts of gods will increase, Asuras will decrease, And hearers and bodhisattvas Will be inconceivable in number.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལྔ་བརྒྱ་ཐམ་པ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ངུ་མོས་བཏབ་པས་ཆོག །
en: The five hundred blessed buddhas then replied to Venerable Ānanda and Venerable Rāhula, “Noble sons, enough weeping!

source: སྨྲེ་སྔགས་བཏོན་པས་ཆོག་གིས་མྱ་ངན་མ་བྱེད་སྨྲེ་སྔགས་མ་འདོན་ཅིག །
en: Enough lamenting! Do not grieve, stop lamenting!

source: འདུས་བྱས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དེ་ཡིན།
en: This is the nature of composite things.

source: མཐའ་དེ་ཡིན།
en: There is an end.

source: འགྲོ་བ་དེ་ཡིན་ཏེ།
en: There is departure.

source: འདུས་བྱས་སྐྱེས་པ་ལ་རྟག་པ་ཉིད་མེད་དེ།
en: There is no permanence for the composite things that arise.

source: མཐའ་འདི་ལྟ་བུ་ཡིན་པས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བདག་ཉིད་ཀྱིས་འདུས་བྱས་ཐམས་ཅད་སྤངས་པས་ན་མངའ་དབང་མི་མཛད་ཅིང་།
en: This is the way of phenomena, and so the thus-gone ones have relinquished all that is composite.

source: ཡང་མངའ་བདག་མཛད་པར་ནམ་ཡང་མི་དགོངས་སོ། །
en: They have no control over those things—they do not even think of having control over them.

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་ངེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འོང་བར་འགྱུར་བའམ། དེ་བཞིན་གཤེགས་པས་ཕྱག་བརྐྱང་སྟེ་འོད་ཀྱིས་སྣང་བར་མཛད་པར་འགྱུར་བའི་འོད་དེས་འོང་བར་འགྱུར་རོ། །
en: Noble sons, either you will come to our buddha fields or the thus-gone ones will extend their arms, and their illuminating light will bring you here.

source: ཁྱེད་ཅག་འདི་ན་འདུག་ན་ཡང་དེ་བཞིན་གཤེགས་པས་ཞལ་ཉེ་བར་སྟོན་པར་འགྱུར་ཞིང་དམ་པའི་ཆོས་བསྟན་པ་ཡང་མངོན་པར་སྟོན་པར་འགྱུར་གྱིས་མྱ་ངན་མ་བྱེད་ཅིག །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། ཇི་ལྟར་ཐུགས་མཉམ་པར་བཞག་པས་ཞབས་གཡས་པའི་མཐེ་བོ་དང་།
en: So even if you stay here, you will be taught directly from the lips of the thus-gone ones, and the sublime Dharma will be set forth for you.

source: ཕྱག་གཡས་པའི་མཐེ་བོ་དང་།
en: So do not grieve!”

source: དེ་བཞིན་དུ་གཡོན་པ་གཉིས་དང་། དེ་བཞིན་དུ་སྐུའི་ཡན་ལག་དང་། ཉིང་ལག་རྣམས་དང་། དེ་བཞིན་དུ་ཞབས་ཀྱི་མཐིལ་འཁོར་ལོའི་མཚན་གྱིས་སྤྲས་པ་གཉིས་དང་། དེ་བཞིན་དུ་འཇམ་ཞིང་དྲ་བས་འབྲེལ་ལ་སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུའི་ཕྱག་སོར་རྣམས་དང་། ཕྱག་རིས་ཤིན་ཏུ་བཀྲ་བའི་ཕྱག་རིན་པོ་ཆེ་གཉིས་དང་། དེ་བཞིན་དུ་མཚན་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་སྐུ་ལྟེ་བའི་དཀྱིལ་འཁོར་དང་།
en: Then at that moment, the Blessed One entered into absorption, and as he rested with his mind in equipoise, billions upon billions of light rays radiated from the big toe of his right foot, from the thumb of his right hand, and likewise from both on the left; from all the limbs of his body, from his minor appendages, from the wheel marks that adorned the soles of his two feet, from the copper-colored fingernails of his smooth, webbed fingers, from the fine lines of his long, broad hands, and likewise from all his major marks; and from the maṇḍala of his navel, from the vicinity of his private parts, from his face, and from between his eyebrows.

source: མདོམས་ཀྱི་གསང་བའི་ཐན་ཀོར་དང་། དེ་བཞིན་དུ་ཞལ་གྱི་དཀྱིལ་འཁོར་དང་། དེ་བཞིན་དུ་ཞལ་གྱི་སྨིན་མཚམས་ནས་འོད་ཟེར་བྱེ་བ་ཕྲག་འབུམ་འབུམ་རབ་ཏུ་བཀྱེ་སྟེ། འོད་ཟེར་རེ་རེའི་ཐོག་མ་ལ་ཡང་པད་མ་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མངོན་པར་སྤྲུལ་ཏོ། །
en: At the tip of each ray of light were billions upon billions of lotuses.

source: པད་མ་རེ་རེའི་སྙིང་པོ་ལ་ཡང་སེང་གེའི་ཁྲི་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མངོན་པར་སྤྲུལ་ཏོ། །སེང་གེའི་ཁྲི་རེ་རེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་རེ་རེ་སྤྲུལ་ཏེ། སངས་རྒྱས་ཀྱི་སྐུས་ཆོས་སྟོན་ཅིང་བཞུགས་པར་གྱུར་ཏོ། །
en: At the center of each lotus were billions upon billions of lion thrones, and upon each lion throne sat a thus-gone one, teaching the Dharma in the form of a buddha.

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་རེ་རེས་ཀྱང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་ཟག་པ་ཟད་པར་བྱ་བའི་ཕྱིར་བཏུལ་ཏོ། །ཁ་ཅིག་ནི་འདོད་ཆགས་དང་བྲལ་བའི་སར་བཏུལ་ཏོ། །
en: And each of the emanated thus-gone ones were taming many billions of beings so as to exhaust their defilements, and some were tamed to the level of freedom from desire.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དབུའི་གཙུག་ནས་འོད་ཟེར་བྱེ་བ་ཕྲག་འབུམ་རབ་ཏུ་བཀྱེ་སྟེ། འོད་ཟེར་རེ་རེའི་ཐོག་མ་ལ་ཡང་པད་མ་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མངོན་པར་སྤྲུལ་ཏོ། །
en: Then from the crown of the Blessed One’s head radiated a trillion rays of light, each with billions upon billions of lotuses at their tip.
